[ {
  "tweetUrl" : "https://x.com/magpiexyz_io/status/1749303412708061577",
  "tweetId" : "1749303412708061577",
  "author" : "magpiexyz_io",
  "content" : "We are thrilled to announce our integration with \n@eigenlayer\n as we aim to support the \n@ethereum\n ecosystem!\n\nIntroducing: \n@Eigenpiexyz_io\nEigenpie is a sophisticated SubDAO crafted by \n@magpiexyz_io\n, meticulously designed to offer Liquid Restaking Services through the framework of EigenLayer.\n\nEigenLayer introduces an innovative infrastructure on Ethereum, aimed at bolstering security within the cryptocurrency space. It presents the innovative concept of \"Restaking,\" permitting users to repeatedly utilize their ETH or LSTs for multiple purposes through LRTs.\n\nWhat are LRTs?\n\nLRTs or Liquid Restaked Tokens, represent restaked ETH or LSTs and provide users with an innovative way to leverage their assets more effectively.\n\nIn Eigenpie, users will be able to deposit their LSTs to receive a liquid restaked version of their tokens (LRTs). This liquid restaked version will allow participants to maximize their ETH holdings by accessing an additional layer of yield.\n\nEigenpie employs a unique approach to Liquid Restaking, focusing on long-term security and reducing risks.\n\nPresenting: Isolated Liquid Restaking.\n\nWe seek to enable support for an array of LSTs from various platforms. #Eigenpie will create an \"Isolated Liquid Restaked\" version of each accepted LST, segregating its specific risks from the broader spectrum of our supported LSTs.\n\nIsolated Liquid Restaked ETH by Eigenpie:\n\nIsolated Liquid Restaked ETH are isolated, liquid, restaked ETH tokens created by Eigenpie. LST holders will have the opportunity to maximize their rewards by converting their assets into Isolated Liquid Restaked ETH. Upon minting Isolated Liquid Restaked ETH via Eigenpie, users will observe a gradual increase in the value of their liquid restaking token relative to ETH.\n\nThe EGP token.\n\n$EGP serves as the governance and revenue-sharing token of \n@Eigenpiexyz_io\n. By fostering decentralized decision-making and providing passive income opportunities, it enhances user involvement and contributes to the platform's success.\n\nIn line with our dedication to transparency and robustness, Eigenpie is poised to undergo exhaustive security audits before its launch. We are collaborating with leading industry specialists to guarantee an extensive and meticulous examination.\n\nA reward point system will be launched to acknowledge the contributions of Eigenpie participants, such as individuals who deposit LST and refer their friends. We appreciate your support. Stay tuned to \n@Eigenpiexyz_io\n for official updates.\n\nDetails:\nhttps://blog.magpiexyz.io/eigenlayer-meets-magpie-liquid-restaking-eth-549c8ce951f0…",
  "hashtags" : [ "#Eigenpie" ],
  "repliesCount" : "548",
  "retweetsCount" : "986",
  "likesCount" : "1.3K",
  "createdAt" : "2024-01-22T05:30:08.000Z",
  "retweeters" : [ "CryptoGideon_", "Webi_Tree", "puntastan", "PostMaklone", "BDOTOSHI", "Itsdvll", "RsX_121", "NYCrypto_Invest", "1CryptoMama", "MarteReymold", "MoonKing___", "TheDefiDog", "Crypto_Cat07", "relzdrops0x", "FlibboScribbo", "mystix_app", "0xBlockSats", "VenomWsf", "DAGking5", "0xadriandefi", "Sssnishi1", "joelrivera_x", "aicp_btc", "pmccy", "Keyth11k", "yamilri18", "VanessaDefi", "avilescomputer", "12ai30", "kato_masa8", "DannyMorales4", "CarlexKush", "LuisTorres2320", "d_danailov", "JPedraza_PR", "AlejoReynoso", "Magpie_XYZ_Arab", "0xMozee4", "WB1913", "JaimeDa28929954" ]
} ]